package JavaFudamentalsTask3;
//  Вывести заданное количество случайных чисел с переходом и без перехода на новую строку
public class Main {

    public static void main(String[] args) {
        // сделаем с воодом через консоль
        // и сделаем с переменными с присвоением
        System.out.println("Введите числа количесовом от 3-х до 6-ти");
        
    }
}
